<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Cachewolf-svn] r2395 - in trunk/docs/CacheWolf Doku: . pics
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/cachewolf-svn/2010-January/index.html" >
   <LINK REL="made" HREF="mailto:cachewolf-svn%40lists.berlios.de?Subject=Re%3A%20%5BCachewolf-svn%5D%20r2395%20-%20in%20trunk/docs/CacheWolf%20Doku%3A%20.%20pics&In-Reply-To=%3C201001070020.o070K1ce008664%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="002318.html">
   <LINK REL="Next"  HREF="002320.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Cachewolf-svn] r2395 - in trunk/docs/CacheWolf Doku: . pics</H1>
    <B>cw-manual at mail.berlios.de</B> 
    <A HREF="mailto:cachewolf-svn%40lists.berlios.de?Subject=Re%3A%20%5BCachewolf-svn%5D%20r2395%20-%20in%20trunk/docs/CacheWolf%20Doku%3A%20.%20pics&In-Reply-To=%3C201001070020.o070K1ce008664%40sheep.berlios.de%3E"
       TITLE="[Cachewolf-svn] r2395 - in trunk/docs/CacheWolf Doku: . pics">cw-manual at mail.berlios.de
       </A><BR>
    <I>Thu Jan  7 01:20:01 CET 2010</I>
    <P><UL>
        <LI>Previous message: <A HREF="002318.html">[Cachewolf-svn] r2394 - trunk/src/CacheWolf/imp
</A></li>
        <LI>Next message: <A HREF="002320.html">[Cachewolf-svn] r2396 - in trunk: res_noewe/languages	src/CacheWolf/imp
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2319">[ date ]</a>
              <a href="thread.html#2319">[ thread ]</a>
              <a href="subject.html#2319">[ subject ]</a>
              <a href="author.html#2319">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: cw-manual
Date: 2010-01-07 01:14:47 +0100 (Thu, 07 Jan 2010)
New Revision: 2395

Modified:
   trunk/docs/CacheWolf Doku/Der_erste_Start.xml
   trunk/docs/CacheWolf Doku/ansichten.xml
   trunk/docs/CacheWolf Doku/pics/ansicht_liste.jpg
   trunk/docs/CacheWolf Doku/pics/list_popup.jpg
   trunk/docs/CacheWolf Doku/pics/spider_gc.jpg
   trunk/docs/CacheWolf Doku/pics/statusleiste.jpg
Log:
Adapt Chapter 3.1 and 3.1.1 to actual build

Modified: trunk/docs/CacheWolf Doku/Der_erste_Start.xml
===================================================================
--- trunk/docs/CacheWolf Doku/Der_erste_Start.xml	2010-01-06 13:02:36 UTC (rev 2394)
+++ trunk/docs/CacheWolf Doku/Der_erste_Start.xml	2010-01-07 00:14:47 UTC (rev 2395)
@@ -44,9 +44,19 @@
           &lt;surname&gt;Klaus Rieger&lt;/surname&gt;
         &lt;/author&gt;
         &lt;revdescription&gt;
-          &lt;para&gt;Bilder auf V1.1.2320 aktualisiert, Tippfehler korrigiert, neue Funktionen beschrieben&lt;/para&gt;
+          &lt;para&gt;Bilder auf V1.1.2320 aktualisiert, Tippfehler korrigiert, neue Funktionen beschrieben
&lt;/para&gt;
         &lt;/revdescription&gt;
       &lt;/revision&gt;
+      &lt;revision&gt;
+        &lt;revnumber&gt;1.01&lt;/revnumber&gt;
+        &lt;date&gt;07.01.2010&lt;/date&gt;
+        &lt;author&gt;
+          &lt;surname&gt;Klaus Rieger&lt;/surname&gt;
+        &lt;/author&gt;
+        &lt;revdescription&gt;
+          &lt;para&gt;Bilder auf V1.1.2386 akutalisiert&lt;/para&gt;
+        &lt;/revdescription&gt;
+      &lt;/revision&gt;
     &lt;/revhistory&gt;
   &lt;/chapterinfo&gt;
   &lt;title&gt;Der erste Start&lt;/title&gt;
@@ -181,7 +191,7 @@
           &lt;para&gt;PL = Polnisch&lt;/para&gt;
         &lt;/listitem&gt;
       &lt;/itemizedlist&gt;
-      &lt;para&gt;Die Sprache kann aus dem Dropdown-Men&#252; ausgew&#228;hlt werden. Die neu eingestellte Sprache wird im Fall einer &#196;nderung allerdings erst nach einem Neustart benutzt.


&lt;/para&gt;
+      &lt;para&gt;Die Sprache kann aus dem Dropdown-Men&#252; ausgew&#228;hlt werden. Die neu eingestellte Sprache wird im Fall einer &#196;nderung allerdings erst nach einem Neustart benutzt.&lt;/para&gt;
       &lt;para&gt;Unter L&#228;ngeneinheit kann auf die Verwendung von Meilen statt km umgestellt werden.&lt;/para&gt;
       &lt;para&gt;Mit &lt;literal&gt;Sortierung nach Cache gruppiert&lt;/literal&gt; wird erreicht, da&#223; bei Sortierung einer Spalte in der Listenansicht immer nur der Hauptwegpunkt eines Caches ber&#252;cksichtigt wird, die Additional Waypoints werden durch die Sortierung nicht erfasst und bleiben stets unter Ihrem Hauptwegpunkt eingeordnet. Andernfalls werden wirklich alle Zeilen entsprechend sortiert, was aber dazu f&#252;hren kann, da&#223; die Additional Waypoints an ganz anderer Stelle in der sortierten Liste auftauchen, wie der zugeh&#246;rige Hauptwegpunkt.&lt;/para&gt;
       &lt;para&gt;Ist &lt;literal&gt;use own symbols&lt;/literal&gt; angehakt und befinden sich im Unterverzeichnis &quot;Symbols&quot;  .png-Dateien, werden diese als alternative Symbole in den Cachewolf geladen. Dabei sollte es sich um PNGs der Gr&#246;&#223;e 15x15 handeln. Wichtig ist die korrekte Benennung der Dateien. Falsch benannte Dateien werden ignoriert.
@@ -224,7 +234,7 @@
       &lt;section id=&quot;DatenImportGPX&quot;&gt;
         &lt;title&gt;Import einer GPX Datei&lt;/title&gt;
         &lt;para&gt;Um an GPX-Dateien von geocaching.com zu kommen, muss man Premium-Mitglied sein. Die GPX-Dateien werden nach einer Pocket Query (h&#228;ufig als zip-Archiv) per Mail verschickt. Alternativ k&#246;nnen GPX-Dateien f&#252;r einzelne Caches direkt heruntergeladen werden. Die heruntengeladenen Dateien k&#246;nnen einfach in ein Verzeichnis abgelegt und m&#252;ssen nicht entpackt werden.&lt;/para&gt;
-        &lt;para&gt;Den Import startest Du durch Anw&#228;hlen von &quot;&lt;literal&gt;Anwendung -&gt; Import -&gt; Importiere GPX&lt;/literal&gt;&quot;. Du kannst eine Datei oder mit Hilfe der Umschalt - Taste mehrere Dateien ausw&#228;hlen.&lt;/para&gt;
+        &lt;para&gt;Den Import startest Du durch Anw&#228;hlen von &quot;&lt;literal&gt;Anwendung -&gt; Import -&gt; aus GPX-Datei&lt;/literal&gt;&quot;. Du kannst eine Datei oder mit Hilfe der Umschalt - Taste mehrere Dateien ausw&#228;hlen.&lt;/para&gt;
         &lt;para&gt;Nach der Wahl der Datei, die du importieren m&#246;chtest, erscheint ein Fenster mit der Frage, ob Du auch Bilder herunterladen m&#246;chtest:&lt;/para&gt;
         &lt;para&gt;
           &lt;inlinemediaobject&gt;
@@ -247,7 +257,7 @@
       &lt;section id=&quot;DatenImportSpider&quot;&gt;
         &lt;title&gt;Direktes herunterladen (spidern)&lt;/title&gt;
         &lt;para&gt;WICHTIG: Durch Anwenden dieser Funktion ruft CW automatisiert die Internetseiten mit den entsprechenden Cachebeschreibungen auf und speichert die dort enthaltenen Daten in seiner Datenbank ab. Dies ist aber lt. den Nutzungsbestimmungen von Geocaching.com verboten. Zuwiederhandlungen k&#246;nnen u.U. auch ein Sperren des entspechenden Nutzerkontos bei Geocaching.com zur Folge haben!&lt;/para&gt;
-        &lt;para&gt;Durch Anw&#228;hlen von &lt;literal&gt;Anwendung -&gt; Import -&gt; Spider von geocaching.com&lt;/literal&gt; wirst Du zuerst aufgefordert Dein Passwort einzugeben. Dies ist das Passwort, das Du f&#252;r Deinen Account bei geocaching.com nutzt. Deinen Alias hast Du ja bereits in den Einstellungen eingetragen. Nach der Eingabe Deines Passwortes loggt sich CacheWolf auf der geocaching.com Homepage ein und pr&#228;sentiert dann die Spideroptionen ein einem neuen Fenster:&lt;/para&gt;
+        &lt;para&gt;Durch Anw&#228;hlen von &lt;literal&gt;Anwendung -&gt; Import -&gt; von geocaching.com&lt;/literal&gt; wirst Du zuerst aufgefordert Dein Passwort einzugeben. Dies ist das Passwort, das Du f&#252;r Deinen Account bei geocaching.com nutzt. Deinen Alias hast Du ja bereits in den Einstellungen eingetragen. Nach der Eingabe Deines Passwortes loggt sich CacheWolf auf der geocaching.com Homepage ein und pr&#228;sentiert dann die Spideroptionen ein einem neuen Fenster:&lt;/para&gt;
         &lt;para&gt;
           &lt;inlinemediaobject&gt;
             &lt;imageobject&gt;
@@ -255,7 +265,7 @@
             &lt;/imageobject&gt;
           &lt;/inlinemediaobject&gt;
         &lt;/para&gt;
-        &lt;para&gt;Ganz oben kann im Drop-Down Feld gew&#228;hlt werden ob alle Cachetypen gespidert werden sollen oder nur ein bestimmter Cachetyp, z.B. alle Traditionals. Unter &lt;literal&gt;max. Abstand&lt;/literal&gt; wird eine Entfernung zum aktuellem Zentrum eingestellt (siehe &lt;xref linkend=&quot;zentrum&quot;/&gt;). Cachewolf wird alle Caches im angegebenen Umkreis um das Zentrum herunterladen. Mit der Einstellung &lt;literal&gt;Max. Anzahl &lt;/literal&gt; wird die maximale Zahl der Caches die gespidert werden begrenzt. Liegen mehr Caches innerhalb des Spiderradiusses wird das spidern nach der angegebenen Anzahl abgebrochen. Damit soll verhindert werden, da&#223; auf der Webseite von GC zu gro&#223;er Traffic entsteht. (Siehe auch WICHTIG ganz oben in diesem Kapitel! Wird der Haken bei &lt;literal&gt;Bilder downloaden&lt;/literal&gt; gesetzt, wird Cachewolf sowohl die Bilder in der Cachebeschreibung als auch die Spoilerbilder herunterladen. Mit dem Haken bei &lt;literal&gt;TBs downloaden &lt;/literal&gt;werden neben den Cachedaten auch die e!
 vtl. in den Caches enthaltenen Trackable Items wie Geocoins oder Travelbugs heruntergeladen und in dem CW-Profil verwaltet. Der Download von bereits gefundenen Caches kann durch Ausw&#228;hlen der Option &lt;literal&gt;Gefundene Caches nicht laden verhindert&lt;/literal&gt; werden.&lt;/para&gt;
+        &lt;para&gt;Ganz oben kann im Drop-Down Feld gew&#228;hlt werden ob alle Cachetypen gespidert werden sollen oder nur ein bestimmter Cachetyp, z.B. alle Traditionals. Es werden alle Caches geladen, die zwischen &lt;literal&gt;min. Abstand &lt;/literal&gt;und &lt;literal&gt;max. Abstand&lt;/literal&gt; um das aktuelle Zentrum liegen (siehe &lt;xref linkend=&quot;zentrum&quot;/&gt;). Gibt man bei &lt;literal&gt;Richtung &lt;/literal&gt;etwas ein, werden nur die Caches geladen, die in der angegebenen Richtung vom Zentrum aus liegen. Bleibt das Feld leer, werden alle Richtungen ber&#252;cksichtigt. Mit der Einstellung &lt;literal&gt;Max. Anzahl &lt;/literal&gt; wird die maximale Zahl der Caches die gespidert werden begrenzt. Liegen mehr Caches innerhalb des Spiderradiusses wird das spidern nach der angegebenen Anzahl abgebrochen. Damit soll verhindert werden, da&#223; auf der Webseite von GC zu gro&#223;er Traffic entsteht. (Siehe auch WICHTIG ganz oben in diesem Kapitel! Wird der Haken bei &lt;literal&gt;Bilder downloaden&lt;/literal&gt; gesetzt, wird Cachewolf sowo!
 hl die Bilder in der Cachebeschreibung als auch die Spoilerbilder herunterladen. Mit dem Haken bei &lt;literal&gt;TBs downloaden &lt;/literal&gt;werden neben den Cachedaten auch die evtl. in den Caches enthaltenen Trackable Items wie Geocoins oder Travelbugs heruntergeladen und in dem CW-Profil verwaltet. Der Download von bereits gefundenen Caches kann durch Ausw&#228;hlen der Option &lt;literal&gt;Gefundene Caches nicht laden verhindert&lt;/literal&gt; werden.&lt;/para&gt;
         &lt;para&gt;Mit &lt;literal&gt;OK&lt;/literal&gt; wird der Spider gestartet. Je nach Entfernung und Cache-Dichte wird das Spidern nun einige Zeit in Anspruch nehmen.&lt;/para&gt;
       &lt;/section&gt;
     &lt;/section&gt;
@@ -268,7 +278,7 @@
       &lt;/section&gt;
       &lt;section id=&quot;DatenImportDownload&quot;&gt;
         &lt;title id=&quot;OpenSpider&quot;&gt;Direkter Download von opencaching.de&lt;/title&gt;
-        &lt;para&gt;Mit der Funktion &lt;literal&gt;Anwendung -&gt; Import -&gt; Download von opencaching.de&lt;/literal&gt; &#246;ffnet sich ein Dialog. Ganz oben im Drop-Down Feld kann die Datenbank gew&#228;hlt werden, aus der die Cachedaten importiert werden sollen. Darunter die Eingabe des Abstands: &lt;/para&gt;
+        &lt;para&gt;Mit der Funktion &lt;literal&gt;Anwendung -&gt; Import -&gt; von opencaching de,pl,cz.uk&lt;/literal&gt; &#246;ffnet sich ein Dialog. Ganz oben im Drop-Down Feld kann die Datenbank gew&#228;hlt werden, aus der die Cachedaten importiert werden sollen. Darunter die Eingabe des Abstands: &lt;/para&gt;
         &lt;para&gt;
           &lt;inlinemediaobject&gt;
             &lt;imageobject&gt;

Modified: trunk/docs/CacheWolf Doku/ansichten.xml
===================================================================
--- trunk/docs/CacheWolf Doku/ansichten.xml	2010-01-06 13:02:36 UTC (rev 2394)
+++ trunk/docs/CacheWolf Doku/ansichten.xml	2010-01-07 00:14:47 UTC (rev 2395)
@@ -49,6 +49,16 @@
           &lt;para&gt;Kapitel fertig.&lt;/para&gt;
         &lt;/revdescription&gt;
       &lt;/revision&gt;
+      &lt;revision&gt;
+        &lt;revnumber&gt;1.01&lt;/revnumber&gt;
+        &lt;date&gt;07.01.2010&lt;/date&gt;
+        &lt;author&gt;
+          &lt;surname&gt;Klaus Rieger&lt;/surname&gt;
+        &lt;/author&gt;
+        &lt;revdescription&gt;
+          &lt;para&gt;an V1.1.2386 angepasst&lt;/para&gt;
+        &lt;/revdescription&gt;
+      &lt;/revision&gt;
     &lt;/revhistory&gt;
   &lt;/chapterinfo&gt;
   &lt;title&gt;Ansichten&lt;/title&gt;
@@ -64,7 +74,7 @@
     &lt;para&gt;Die Listenansicht zeigt tabellarisch die Caches im ausgew&#228;hlten
     Profil an. Welche Spalten sichtbar sind ,l&#228;&#223;t sich in den Einstellungen
     konfigurieren (siehe &lt;xref linkend=&quot;einstellungListe&quot;/&gt;). Ein Doppelklick
-    auf eine Zeile &#246;ffnet die Beschreibung zu dem Cache.&lt;/para&gt;
+    auf eine Zeile &#246;ffnet die Beschreibung zu dem Cache (siehe Section &lt;xref linkend=&quot;Beschreibungsansicht&quot;/&gt; )&lt;/para&gt;
     &lt;para&gt;&lt;inlinemediaobject&gt;
         &lt;imageobject&gt;
           &lt;imagedata fileref=&quot;pics/ansicht_liste.jpg&quot;/&gt;
@@ -97,8 +107,12 @@
       &lt;/inlinemediaobject&gt; l&#228;&#223;t sich ein- und auschalten. Der Filter &lt;xref linkend=&quot;filter&quot;/&gt; wird hier ausf&#252;hrlich beschrieben.&lt;/para&gt;
     &lt;para&gt;Durch einen Klick auf den Spaltenkopf wird die Tabelle neu
     sortiert., z.B. nach der Entfernung zum Zentrum. Zuerst aufsteigend und
-    dann absteigend, oder andersherum, je nachdem &quot;wo&quot; man angefangen hat. Die
-    Spaltenbreite l&#228;&#223;t sich ebenfalls ver&#228;ndern.&lt;/para&gt;
+    dann absteigend, oder andersherum, je nachdem &quot;wo&quot; man angefangen hat. Die Sortierrichtung wird durch einen Marker   &lt;inlinemediaobject&gt;
+        &lt;imageobject&gt;
+          &lt;imagedata fileref=&quot;pics/sortierrichtung.jpg&quot;/&gt;
+        &lt;/imageobject&gt;
+      &lt;/inlinemediaobject&gt; vor dem Spaltennamen angezeigt. Die
+    Spaltenbreite l&#228;&#223;t sich durch Klicken und Verschieben der Spaltentrennlinien ebenfalls ver&#228;ndern.&lt;/para&gt;
     &lt;para id=&quot;WegpunktStatus&quot;&gt;&lt;emphasis role=&quot;bold&quot;&gt;In der Listenansicht k&#246;nnen einzelne Zeilen mit Farben hinterlegt sein:&lt;/emphasis&gt;&lt;/para&gt;
     &lt;itemizedlist&gt;
       &lt;listitem&gt;
@@ -204,21 +218,26 @@
           in der Listenansicht an.&lt;/para&gt;
         &lt;/listitem&gt;
         &lt;listitem&gt;
+          &lt;para&gt;&lt;literal&gt;Addis einblenden&lt;/literal&gt; zeigt die zugeh&#246;rigen Additional Waypoints f&#252;r einen Cache an, wenn mittels Filter die Addis ausgeblendet sind. Der Text &#228;ndert sich dann zu &lt;literal&gt;Addis ausblenden&lt;/literal&gt; damit k&#246;nnen die angezeigten Additional Waypoints wieder ausgeblendet werden. Hat man in den Einstellungen zur Listenansicht die Spalte &lt;literal&gt;# Addis&lt;/literal&gt; eingeblendet, dann kann man bei jedem Hauptwegpunkt sehen, ob und wieviele zugeh&#246;rige Additional Waypoints vorhanden sind (in der Spalte &quot;A&quot;)&lt;/para&gt;
+        &lt;/listitem&gt;
+        &lt;listitem&gt;
           &lt;para&gt;&lt;literal&gt;Im Browser online &#246;ffnen&lt;/literal&gt;: Die originale
           Cachebeschreibung wird von geocaching.com oder opencaching.de
           gezeigt. Ben&#246;tigt eine online-Verbindung. Die Daten in Cachewolf
-          werden hierbei nicht aktualisiert! In der Java Version wird dies
-          nicht funktionieren, da aktuell ein Bug in der EWE VM vorhanden
-          ist.&lt;/para&gt;
+          werden hierbei nicht aktualisiert! &lt;/para&gt;
         &lt;/listitem&gt;
         &lt;listitem&gt;
           &lt;para&gt;&lt;literal&gt;Im Browser offline &#246;ffnen&lt;/literal&gt;: Die
           Cachebeschreibung wird in dem Browser, der in den Pr&#228;ferenzen
-          eingestellt wurde, dargestellt. In der Java Version wird dies nicht
-          funktionieren, da aktuell ein Bug in der EWE VM vorhanden
-          ist.&lt;/para&gt;
+          eingestellt wurde, dargestellt. &lt;/para&gt;
         &lt;/listitem&gt;
         &lt;listitem&gt;
+          &lt;para&gt;&lt;literal&gt;Im Browser online loggen&lt;/literal&gt; &#246;ffnet im eingestellten Browser die Logseite des angew&#228;hlten Caches.&lt;/para&gt;
+        &lt;/listitem&gt;
+        &lt;listitem&gt;
+          &lt;para&gt;&lt;literal&gt;In Googlemaps &#246;ffnen&lt;/literal&gt; &#246;ffnet im eingestellten Browser Google Maps und zeigt f&#252;r den angew&#228;hlten Wegpunkt (sofern dieser Koordinaten besitzt) einen Marker auf der Karte an. Hat der Wegpunkt keine Koordinaten &#246;ffnet sich der Browser nicht.&lt;/para&gt;
+        &lt;/listitem&gt;
+        &lt;listitem&gt;
           &lt;para&gt;&lt;literal&gt;Markierte l&#246;schen&lt;/literal&gt;: Es werden alle Wegpunkte
           gel&#246;scht, die mit einem H&#228;kchen versehen sind. Bevor die Wegpunkte
           tats&#228;chlich gel&#246;scht werden, erfolgt noch eine Sicherheitsabfrage in
@@ -396,7 +415,7 @@
       &lt;/inlinemediaobject&gt;&lt;/para&gt;
   &lt;/section&gt;
   &lt;section&gt;
-    &lt;title&gt;Beschreibung&lt;/title&gt;
+    &lt;title id=&quot;Beschreibungsansicht&quot;&gt;Beschreibung&lt;/title&gt;
     &lt;para&gt;Die Beschreibung erfolgt weitestgehend in HTML. Bilder werden, falls
     m&#246;glich, ebenfalls angezeigt. Ansonsten kann man sich die Bilder auch
     einzeln in der Bilderansicht (n&#228;chster Reiter) anschauen.&lt;/para&gt;

Modified: trunk/docs/CacheWolf Doku/pics/ansicht_liste.jpg
===================================================================
(Binary files differ)

Modified: trunk/docs/CacheWolf Doku/pics/list_popup.jpg
===================================================================
(Binary files differ)

Modified: trunk/docs/CacheWolf Doku/pics/spider_gc.jpg
===================================================================
(Binary files differ)

Modified: trunk/docs/CacheWolf Doku/pics/statusleiste.jpg
===================================================================
(Binary files differ)


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="002318.html">[Cachewolf-svn] r2394 - trunk/src/CacheWolf/imp
</A></li>
	<LI>Next message: <A HREF="002320.html">[Cachewolf-svn] r2396 - in trunk: res_noewe/languages	src/CacheWolf/imp
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2319">[ date ]</a>
              <a href="thread.html#2319">[ thread ]</a>
              <a href="subject.html#2319">[ subject ]</a>
              <a href="author.html#2319">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/cachewolf-svn">More information about the Cachewolf-svn
mailing list</a><br>
</body></html>
